#+TITLE: Econometría -- Capítulo 9 -- Variables Dicótomas
#+SUBTITLE: Apuntes del capítulo 9: Variables Dicótomas
#+AUTHOR: Emanuel Quintana Silva, basado en el libro de Econometría de Damodar Gujarati
#+DATE: <2026-05-29 Fri>
#+LANGUAGE: es
#+OPTIONS: toc:2 num:t ^:nil
#+PROPERTY: header-args:stata :results output :exports both

** Estimación del modelo (9.2.1)

#+BEGIN_SRC stata
use "C:\tmp\tabla91.dta", clear
set linesize 120

regress salario d2 d3
estat ic
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_6708.log
  log type:  text
 opened on:  30 May 2026, 12:52:16

. use "C:\tmp\tabla91.dta", clear

. set linesize 120

.
. regress salario d2 d3

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(2, 48)        =      1.05
       Model |   100313240         2    50156620   Prob > F        =    0.3567
    Residual |  2.2857e+09        48  47619402.8   R-squared       =    0.0420
-------------+----------------------------------   Adj R-squared   =    0.0021
       Total |  2.3860e+09        50  47720891.5   Root MSE        =    6900.7

------------------------------------------------------------------------------
     salario | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          d2 |   1667.956   2435.287     0.68   0.497    -3228.516    6564.428
          d3 |  -1592.792   2542.474    -0.63   0.534    -6704.778    3519.194
       _cons |   48014.62   1913.905    25.09   0.000     44166.45    51862.78
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |          N   ll(null)  ll(model)      df        AIC        BIC
-------------+---------------------------------------------------------------
           . |         51  -522.7233  -521.6281       3   1049.256   1055.052
-----------------------------------------------------------------------------
Note: BIC uses N = number of observations. See [R] IC note.

. clear

. log close
      name:  <unnamed>
       log:  C:\tmp\stata_out_6708.log
  log type:  text
 closed on:  30 May 2026, 12:52:18
------------------------------------------------------------------------------------------------------------------------
#+end_example

** Estimación del modelo extendido con gasto

#+BEGIN_SRC stata
use "C:\tmp\tabla91.dta", clear
set linesize 120

regress salario d2 d3 gasto
estat ic
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_6932.log
  log type:  text
 opened on:  30 May 2026, 12:53:19

. use "C:\tmp\tabla91.dta", clear

. set linesize 120

.
. regress salario d2 d3 gasto

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(3, 47)        =     15.80
       Model |  1.1981e+09         3   399380087   Prob > F        =    0.0000
    Residual |  1.1879e+09        47  25274559.9   R-squared       =    0.5021
-------------+----------------------------------   Adj R-squared   =    0.4704
       Total |  2.3860e+09        50  47720891.5   Root MSE        =    5027.4

------------------------------------------------------------------------------
     salario | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          d2 |  -2975.548   1908.968    -1.56   0.126    -6815.896    864.8003
          d3 |   -3050.15   1865.431    -1.64   0.109    -6802.913    702.6133
       gasto |   2.426807   .3682223     6.59   0.000     1.686039    3.167574
       _cons |   27981.88   3344.145     8.37   0.000     21254.33    34709.44
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |          N   ll(null)  ll(model)      df        AIC        BIC
-------------+---------------------------------------------------------------
           . |         51  -522.7233  -504.9385       4   1017.877   1025.604
-----------------------------------------------------------------------------
Note: BIC uses N = number of observations. See [R] IC note.

. clear

. log close
      name:  <unnamed>
       log:  C:\tmp\stata_out_6932.log
  log type:  text
 closed on:  30 May 2026, 12:53:21
------------------------------------------------------------------------------------------------------------------------
#+end_example


